---
title: FailureHandlingOptions
classe: Autodesk.Revit.DB.FailureHandlingOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# FailureHandlingOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `failureHandlingOptions.IsValidObject` | Boolean |
| `Void Dispose()` | `failureHandlingOptions.Dispose()` | Void |
| `Boolean GetClearAfterRollback()` | `failureHandlingOptions.GetClearAfterRollback()` | Boolean |
| `Boolean GetDelayedMiniWarnings()` | `failureHandlingOptions.GetDelayedMiniWarnings()` | Boolean |
| `IFailuresPreprocessor GetFailuresPreprocessor()` | `failureHandlingOptions.GetFailuresPreprocessor()` | IFailuresPreprocessor |
| `Boolean GetForcedModalHandling()` | `failureHandlingOptions.GetForcedModalHandling()` | Boolean |
| `ITransactionFinalizer GetTransactionFinalizer()` | `failureHandlingOptions.GetTransactionFinalizer()` | ITransactionFinalizer |
| `FailureHandlingOptions SetClearAfterRollback(Boolean)` | `failureHandlingOptions.SetClearAfterRollback(bFlag)` | FailureHandlingOptions |
| `FailureHandlingOptions SetDelayedMiniWarnings(Boolean)` | `failureHandlingOptions.SetDelayedMiniWarnings(bFlag)` | FailureHandlingOptions |
| `FailureHandlingOptions SetFailuresPreprocessor(IFailuresPreprocessor)` | `failureHandlingOptions.SetFailuresPreprocessor(preprocessor)` | FailureHandlingOptions |
| `FailureHandlingOptions SetForcedModalHandling(Boolean)` | `failureHandlingOptions.SetForcedModalHandling(bFlag)` | FailureHandlingOptions |
| `FailureHandlingOptions SetTransactionFinalizer(ITransactionFinalizer)` | `failureHandlingOptions.SetTransactionFinalizer(finalizer)` | FailureHandlingOptions |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```